

concept = [
    "分拆上市意愿","人民币贬值受益","富时罗素概念","富时罗素概念股","标普道琼斯A股","沪股通","深股通","融资融券","转融券标的","再融资","送转填权","股权转让","并购重组","超跌","MSCI概念","一季报增长","一季报预增","业绩增长","年报增长","超跌","央企国企改革","地方国企改革","三季报增长","半年报预增","中报增长","山东国企改革","上海国企改革","江苏国企改革","深圳国企改革","重庆国企改革","广东国企改革","北京国企改革","天津国企改革","甘肃国企改革","河南国企改革","山西国企改革","浙江国企改革","珠海国企改革","四川国企改革","上海","深圳","浙江","湖南","武汉","海南","科创板","年报预增","三季报预增","证金持股","行业龙头","参股新三板","同花顺漂亮100"
]



def filter_concept(date):
    return [ for x in date if x not in filter_con]