
from shares.management.commands.wencai2 import trend, trendCode, acodes, common, pic_n, trendDown

concept1 = [
    "专精特新", "转融券标的", "注册制次新股", "智慧城市", "新股与次新股", "融资融券", "循环经济", "科创次新股", "摘帽", "地方国企改革",
    "国企改革", "上海国企改革", "共同富裕示范区", "半年报预增", "参股券商", "物业管理", "送转填权", "人民币贬值受益", "老字号",
    "地方国企改革", "国企改革", "上海国企改革", "深股通", "沪股通", "核准制次新股", "国产替代", "中俄贸易概念", "央企国企改革",
    "一带一路",
    "B转H", "健康中国", "参股银行", "PPP概念", "雄安新区", "富时罗素概念", "富时罗素概念股", "美丽中国", "标普道琼斯A股", "新型城镇化",
    "MSCI概念", "中材系", "中字头股票", "养老金持股", "高送转预期", "长三角一体化", "军民融合", "国家大基金持股", "知识产权保护", "浙江国企改革",
    "参股民营银行", "高校", "外贸受益概念", "贸易战受益股", "上海自贸区",
    "黑龙江自贸区", "中铁系", "两江新区", "重庆自贸区", "金改",
    "成渝特区", "债转股(AMC概念)", "重庆国企改革", "露营经济", "粤港澳大湾区", "黔中经济区",
    "养老概念", "横琴新区", "统一大市场",
    "数字乡村", "招商系",

    "中非合作", "分拆上市意愿",
    "杭州亚运会", "黑龙江自贸区", "两江新区", "重庆自贸区", "金改",
    "成渝特区", "债转股(AMC概念)", "重庆国企改革", "粤港澳大湾区", "黔中经济区",
    "养老概念", "横琴新区",
    "统一大市场", "中非合作", "分拆上市意愿", "数字乡村", "招商系", "油品改革", "两桶油改革",

    "中原经济区", "国开行", "免税店", "村镇银行", "电力改革", "一元股",
    "进口博览会", "四川国企改革", "C2M概念", "珠海国企改革", "京津冀一体化", "河南自贸区",

    "海南旅游岛", "三沙", "西沙旅游", "厚朴系", "海航系", "自由贸易港", "东北亚经贸中心", "环渤海", "天津自贸区", "天津国企改革",
    "IP概念", "电信业整合",

    "智慧党建", "征信", "奢侈品", "APEC会议",
    "大连自贸区", "辽宁国企改革", "福建污染减排", "民营金融", "武汉金改", "武汉自贸区", "新疆自贸区", "中船系", "公路建设",

    "西安自贸区", "保障房", "参股万达商业", "京东金融概念", "老八股", "中航系", "宽带中国", "广播电视", "航运港口", "中远系", "中央政务区", "山西国企改革",
    "中朝贸易区",
    "铁路混改", "国际板", "游轮", "渤海粮仓", "三农", "农垦改革", "转基因",

    "生态城乡", "中兵系", "西咸新区", "广东自贸区", "福建土改", "优先股概念",
    "家庭农场", "湖北国企改革", "鄱阳湖经济区", "赣南振兴", "云南国企改革", "上海金改", "舟山自贸区", "中粮系国企改革", "中粮系", "新疆建设兵团", "外资券商影子股",
    "北部湾自贸区", "互联网期货", "南沙新区", "贵州国企改革", "数字出版示范", "湖南自贸区", "中韩自贸区", "赛马概念", "农业信息化", "供销社", "陕西自贸区", "新兴板概念",
    "国投系", "驾驶培训", "洞庭湖生态经济区", "西藏国企改革", "中国电科系", "移动金融", "青岛自贸区", "中科系", "马歇尔计划", "SNS概念",
    "杭州亚运会", "体育产业", "LNG动力船", "LNG加气站", "中铁系",

    "成都天府新区", "人力资源服务", "金控平台", "明星参股概念", "中概股回归", "黄金水道", "嘉兴土改", "澳交所概念", "首都副中心", "武汉光谷", "农信社改革", "中以自贸区",
    "汽车关税下调", "范冰冰概念股", "甘肃国企改革", "航天系", "S股", "广西中医药", "农业供给侧改革", "诚通系", "徐翔概念股", "参股外资金融", "新疆电源项目",
    "中瑞自贸协定", "福建物联网", "广东基建", "江苏污水处理", "紫光系", "郑州航空港", "中澳自贸区", "安徽自贸区", "黄光裕概念", "新疆旅游", "物产系", "外汇局持股", "际华系",
    "王亚伟持股", "成泉资本持股",

    "蚂蚁金服概念", "抖音概念", "百度概念", "网易概念", "拼多多概念", "快手概念", "滴滴概念股", "谷歌概念", "代糖概念", "微信概念", "海底捞概念",
    "商汤科技概念", "寒武纪概念", "美团概念股", "黑洞概念", "郭台铭概念",
    "机器人概念", "比亚迪概念",
    "英伟达概念", "AIGC概念", "医美概念", "facebook概念", "腾讯概念", "阿里巴巴概念", "足球概念", "粮食概念", "宁德时代概念",
    "白酒概念", "京东概念", "电梯概念", "医疗器械概念", "ChatGPT概念", "华为概念", "国四概念", "新材料概念",
    "小鹏汽车概念", "有机硅概念", "氟化工概念", "小米概念", "苹果概念", "消费电子概念",
    "航运概念",
    "集成电路概念", "芯片概念", "幽门螺杆菌概念", "F5G概念", "光伏概念", "富士康概念",

    "MLOps概念", "独角兽概念", "6G概念", "汽车制造概念", "华为海思概念股", "厄尔尼诺概念", "啤酒概念", "换电概念", "联想概念", "肝炎概念", "小金属概念", "船舶升级概念",
    "辉瑞概念", "台湾概念股", "北交所概念", "阿尔茨海默概念", "钛白粉概念", "CRO概念", "盐野义概念", "PVDF概念", "水泥概念", "汽车拆解概念", "净水概念", "猴痘概念", "黄金概念",
    "EDR概念", "埃博拉概念", "NFT概念", "覆铜板概念", "LG概念", "特钢概念", "寨卡病毒概念", "超导概念", "以纸代塑概念", "魔兽概念", "大疆创新概念", "超材料概念", "MERS概念",
    "除雪概念"
    "TMT", "华为鲲鹏", "高端装备", "参股新三板", "同花顺漂亮100", "创投", "安徽国企改革", "冬奥会", "数字中国",
    "医疗改革", "吉林国企改革", "深圳国企改革", "林场改革", "北京国企改革", "南京国企改革", "湖南国企改革",
    "北京自贸区",
    "两会", "兰州自贸区", "兰新白试验区", "大运会", "杭州湾大湾区", "人民币升值", "东盟自贸区", "中俄自贸区", "振兴东北", "中巴经济走廊", "海南自贸区",
    "平潭免税区", "海峡两岸", "滨海新区","福建基建", "海绵城市",
    "中国科学院系","航运系", "反恐",  "抗旱", "中电投合并", "重庆水资源","服务外包",
]


def conceptCom(codes):
    for item in codes:
        if item["concept"] is not None:
            item["concept"] = [x for x in item["concept"] if x in concept1]

    return trend.top(codes)