from shares.management.commands.wencai2 import trend, trendCode, acodes, common, pic_n, trendDown


concept2 = [
    "新基建", "互联网金融", "文化传媒", "世界杯", "休闲零食", "社区团购", "奥运会", "广告营销", "小额贷款",
    "住房租赁", "沥青", "数字水印", "油价上调", "网红经济", "网络直播", "方舱医院", "移动支付", "家庭医生", "疫情监测",
    "集装箱", "新冠疫苗", "永磁高铁", "小额再贷款", "露营经济", "金属铜", "金属镍", "金属锌", "金属铅", "红枣", "人造肉", "抖音小店",
    "农业种植", "旅游", "消费金融", "物流电商平台", "有机食品", "食用油", "机械装备", "迪士尼", "透明工厂", "航空租赁", "共享医院", "共享经济", "在线旅游", "易信",
    "网络视频", "数字阅读", "汽车电商", "黄金租赁", "番茄酱", "培育钻石", "网约车", "猪肉收储", "家禽养殖", "牛羊肉", "大豆", "乳业", "移动购物",
    "盲盒", "双十一", "羊绒", "平面媒体", "体育用品", "余额宝", "空中巴士", "乳粉", "互联网银行", "智能电视",
    "网络电视", "电子发票", "ATM机", "数据交易中心", "玉米", "互联网钢铁", "共享单车", "快递", "圣诞节", "K12教育",

    "国产软件", "大数据", "碳中和", "智能物流", "物联网", "传感器", "垃圾分类", "创新药", "元宇宙",
    "特高压", "新基建", "区块链应用", "DRG/DIP", "数据确权", "眼科医疗", "化妆护肤品", "数字货币",
    "地下管网", "锂电池", "钠离子电池", "动力电池回收", "军工", "虚拟现实", "数字孪生", "区块链", "电子身份证", "第三代半导体", "商超百货", "新零售", "机器视觉",
    "web3.0", "信创", "人工智能", "边缘计算", "装配式建筑", "建筑节能", "铁路基建", "国六标准、国六排放、国六", "磁悬浮", "工业机器人",
    "工业4.0", "燃料电池", "新能源汽车", "智能制造", "减速器", "空气能热泵", "充电桩", "智能电网", "数字经济", "储能", "数据中心", "高压快充",
    "新冠检测", "汽车电子", "汽车热管理", "数据安全", "数字营销", "网络安全", "空间计算", "金融科技", "国产操作系统", "污水处理",
    "核电", "石墨烯", "节能照明", "节能环保", "天然气", "煤化工", "氢能源", "农机", "OLED材料", "OLED", "共封装光学（CPO）", "轨道交通", "智能交通",
    "生物医药", "民营医院", "中医药", "电子商务", "医药电商", "光刻胶", "减肥药", "特斯拉",
    "新能源", "危废处理", "再生水", "循环经济", "农村环境治理", "固废处理", "医疗废物处理", "土壤修复", "玻璃纤维", "锂电隔膜", "5G", "风电",
    "汽车芯片", "可降解塑料", "染料", "电子信息", "遥感技术",  "卫星导航", "芯片制造", "物联网平台层", "国产航母", "无人机", "车联网", "航空航天", "激光",
    "家用电器", "华为汽车", "仿制药", "新冠治疗", "云计算", "智慧政务", "虚拟数字人", "融媒体",  "数据要素", "虚拟电厂", "无线耳机",
    "智能音箱", "芯片封装测试", "工业母机", "存储芯片", "工业互联网", "分离膜", "丙烯", "太阳能", "三星", "聚丙烯", "膜材料", "柔性屏", "质子交换膜", "3D玻璃",
    "互联网医疗", "环氧树脂", "WiFi6", "先进封装（Chiplet）", "AI芯片", "MCU芯片", "东数西算（算力）",

    "人脸识别", "雷达", "在线教育", "芯片设计", "服务机器人", "3D打印", "尾气治理", "车用尿素", "锂电原料", "磷酸铁锂", "智能穿戴", "语音技术", "固态电池", "光热发电",
    "增强现实", "云游戏", "数字视觉", "职业教育", "MR（混合现实）", "两轮车", "高铁", "元器件", "VR设备", "电力物联网", "钙钛矿电池", "光伏建筑一体化", "碳化硅", "柔性直流输电",
    "IGBT", "保健品", "维生素", "冷链物流", "食品包装", "陶瓷产品", "超清视频", "芯片设备", "碳交易", "大消费", "正极材料", "负极材料", "VPN", "态势感知",
    "国资云", "华为欧拉","口罩", "PET铜箔",  "时空大数据", "MiniLED", "智能家居", "超级品牌", "智能医疗",
    "医疗机器人", "壳资源", "HJT电池", "TOPCON电池", "电机电控", "白银", "SAAS", "网络游戏", "动漫", "云办公","富媒体", "抗肿瘤", "一体化压铸",

    "新型烟草", "可燃冰", "牙科医疗", "绿色电力", "安防", "OLED面板", "电子纸", "影视娱乐", "有色铝", "铝材加工", "稀有金属", "生物安全", "抗病毒面料", "海水淡化",
    "海洋经济", "海工装备","淘宝手机", "黄金暴跌受益",  "食品安全", "新疆发展", "银联", "北汽新能源", "药品信息化追溯",
    "太空经济",  "无人岛开发", "盐湖提锂", "POE胶膜", "重组蛋白", "千金藤素", "手机芯片", "生物疫苗", "金属回收", "精装修",
    "饲料", "猪肉", "养鸡", "疫苗存储", "换芯", "NFC", "指纹支付", "物联网传输层", "金融IC", "南水北调", "节水灌溉","手机游戏", "棚户区改造",
    "纳米抗擦墨", "仿制药一致性评价", "板蓝根", "新冠特效药", "超超临界发电", "类稀土", "萤石", "制冷剂", "甲酸", "消毒剂", "氢氟酸", "环球主题公园", "绿色轮胎", "橡胶",
   "乙肝治疗", "银屑病", "高血压药", "工程建材", "纸浆", "环氧丙烷", "烧碱", "双氧水", "稀土永磁", "油气管网", "天然气管道", "西气东输", "能源互联网", "多肽药",
    "工业节水", "环境监测", "PA66", "建筑涂料", "溴素", "磷化工", "硅晶圆", "分子诊断", "霍乱", "石灰石", "兽药", "西尼罗病毒", "猪瘟疫情", "动物疫苗", "禽流感",
    "宠物经济", "线材", "活性炭", "锂电制造", "台积电", "六氟磷酸锂", "校车", "新能源整车", "钨", "稀缺资源", "低辐射玻璃（Low-E）", "辉钼", "钼", "铟", "锌电池",
    "深紫外光", "量子霍尔", "激光器", "钾肥", "化肥", "草甘膦", "钌催化剂", "铁矿石", "金属锑", "密码安全管理", "量子科技", "干细胞", "细胞免疫治疗",
    "铜冶炼", "网络切片", "IPV6", "胎压监测", "虚拟机器人", "毫米波雷达", "抽水蓄能", "锂矿", "消防装备", "废气处理", "油品升级", "冬虫夏草", "高压氧舱", "体感交互",
    "王者荣耀", "通信基站", "射频器", "节能电机", "硫磺", "余热发电", "镍氢电池", "塑化剂", "医药安全","军用无人机", "新型杀菌剂", "丙烯酸", "油页岩", "油气装备",
    "图像识别", "脑机接口", "合成革", "空气净化", "基站射频", "金属镁", "粘胶短纤", "稀土整合", "氧化铝", "PVC", "太阳能热水器", "分布式发电", "铅蓄电池", "有轨电车",
    "工控信息安全", "MTBE", "甲乙酮", "托育服务", "抗寒", "醋酸", "甲醇", "焦炭", "蒙脱石散", "草地贪夜蛾防治", "4D打印", "电石", "液氯", "MDI", "超级电容",
    "太空望远镜", "陶瓷电容", "肾透析", "肝素", "煤价下跌受益", "金属锰", "ABF载板", "预警机", "通用航空", "太赫兹", "毛发医疗", "尿素", "砷化镓", "第四代半导体",
    "矿山生态修复",  "片碱", "富勒烯", "超硬材料", "智能汽车", "铌", "GEP", "VR平台", "纤维板", "甲醛", "煤头尿素", "智能表", "WIN升级",
    "新能源物流车", "食盐", "粗苯", "硫酸铵", "轧板", "人造太阳", "LNG汽车", "触摸屏", "区块链底层", "OLED设备制造", "TOF镜头", "屏下指纹技术", "菜籽油", "菜籽粕",
    "燃料乙醇", "岩棉", "油气开采", "虚拟导游", "裸眼3D", "无人银行", "CAD", "冬奥纪念品", "氨纶", "人参", "全屋定制", "智能路由器", "移动天线", "VR直播", "POCT",
    "电子皮肤", "狂犬病", "二维码识别", "微电子", "农村电商", "白炭黑", "炭黑", "液态金属", "轻型合金", "石墨烯油墨", "幼儿教育", "音乐产业", "VR影视", "血液制品",
    "天然气锅炉", "电子书", "铀矿", "甘蔗废料利用", "白糖", "尿不湿", "OGS触控屏", "超级计算机", "靶材", "文具", "棕榈油", "全息手机", "氯化铵", "忆阻器", "液化气",
    "芬太尼", "虹膜识别", "电缆", "三氯化磷", "智能眼镜", "骨传导", "双胶纸", "数字电视", "新媒体", "GPU", "OLED芯片", "机器学习", "HPV疫苗", "PTA", "盐酸",
    "钒涨价", "海洋油污清理", "沪锡", "增碳剂", "棉纱", "棉花种植", "蜱虫", "吡啶", "松脂", "箱板纸", "登革热", "二手车", "潮汐发电", "海底隧道", "磷酸一铵", "铝离子电池",
    "基站天线", "科技保险", "棉", "婚庆", "鱼蛋白", "塑料钞票", "流媒体", "OLED显示模组", "智能手表", "海岛整治修复", "长江防护林", "透明计算", "广州旅游", "油豆", "土豆",
    "月球车", "分布式燃气发电", "绿色消费", "临近空间", "纯碱", "醋酐", "便利店", "胶合板", "挖矿设备", "癌症定量检测", "电解锰", "自动售货机", "殡仪服务", "智能自行车",
    "大数据反恐", "硫酸钾", "民用无人机", "苹果期货", "碳海绵", "丙烷脱氢", "感知氧气", "胶原蛋白", "铬铁", "五一出境游", "病毒检测芯片", "锌二氧化锰", "铂矿", "硝酸钠",
    "专网通信", "普洱茶",  "鸡尾酒", "电视游戏", "丝绸", "人民币防伪", "大容量通信", "TDI", "乙烯", "避孕套", "正丁醇", "环己酮", "智能玻璃", "人工角膜"

]


def conceptCom(codes):
    for item in codes:
        if item["concept"] is not None:
            item["concept"] = [x for x in item["concept"] if x in concept2]

    return trend.top(codes)